In [2]:
import pandas as pd

In [3]:
gods_df = pd.read_csv("greek_gods.csv")
gods_df1 = gods_df.rename(columns = {'God':'name'})
gods_df1

       name                 Domain       Symbol    Age
0      Zeus       King of the Gods  Thunderbolt  10000
1  Poseidon         God of the Sea      Trident   9000
2      Hera      Queen of the Gods      Peacock   8500
3    Athena      Goddess of Wisdom          Owl   8000
4     Hades  God of the Underworld       Helmet   9500

In [4]:
goddesses_df = pd.read_csv("greek_goddesses.csv")
goddesses_df1 = goddesses_df.rename(columns = {'Goddess':'name'})
goddesses_df1

         name                   Domain         Symbol   Age
0   Aphrodite          Goddess of Love           Dove  7000
1     Artemis      Goddess of the Hunt  Bow and Arrow  7500
2     Demeter   Goddess of Agriculture          Wheat  8000
3      Hestia    Goddess of the Hearth           Fire  8200
4  Persephone  Queen of the Underworld    Pomegranate  7800

1.Merge the data from greek_gods.csv and greek_goddesses.csv based on a common field and create a new table that includes
  information about both gods and goddesses.

In [5]:
merged_df = pd.concat([gods_df1, goddesses_df1], ignore_index=True)

In [6]:
merged_df

         name                   Domain         Symbol    Age
0        Zeus         King of the Gods    Thunderbolt  10000
1    Poseidon           God of the Sea        Trident   9000
2        Hera        Queen of the Gods        Peacock   8500
3      Athena        Goddess of Wisdom            Owl   8000
4       Hades    God of the Underworld         Helmet   9500
5   Aphrodite          Goddess of Love           Dove   7000
6     Artemis      Goddess of the Hunt  Bow and Arrow   7500
7     Demeter   Goddess of Agriculture          Wheat   8000
8      Hestia    Goddess of the Hearth           Fire   8200
9  Persephone  Queen of the Underworld    Pomegranate   7800

2.Filter the merged table to only include gods and goddesses who are older than 8000 years,
  then sort them based on their ages in descending order.

In [7]:
age_filtered_df = merged_df[merged_df['Age']>=8000]
sorted_df = age_filtered_df.sort_values(by='Age', ascending=False)
sorted_df

       name                  Domain       Symbol    Age
0      Zeus        King of the Gods  Thunderbolt  10000
4     Hades   God of the Underworld       Helmet   9500
1  Poseidon          God of the Sea      Trident   9000
2      Hera       Queen of the Gods      Peacock   8500
8    Hestia   Goddess of the Hearth         Fire   8200
3    Athena       Goddess of Wisdom          Owl   8000
7   Demeter  Goddess of Agriculture        Wheat   8000

3.Join the two tables based on the "Domain" field and calculate the average age of gods and goddesses in each domain.

In [8]:
joined_df = pd.merge(gods_df,goddesses_df, on="Domain", how = 'outer')
joined_df

,God,Domain,Symbol_x,Age_x,Goddess,Symbol_y,Age_y
0,Poseidon,God of the Sea,Trident,9000.0,NaN,NaN,NaN
1,Hades,God of the Underworld,Helmet,9500.0,NaN,NaN,NaN
2,NaN,Goddess of Agriculture,NaN,NaN,Demeter,Wheat,8000.0
3,NaN,Goddess of Love,NaN,NaN,Aphrodite,Dove,7000.0
4,Athena,Goddess of Wisdom,Owl,8000.0,NaN,NaN,NaN
5,NaN,Goddess of the Hearth,NaN,NaN,Hestia,Fire,8200.0
6,NaN,Goddess of the Hunt,NaN,NaN,Artemis,Bow and Arrow,7500.0
7,Zeus,King of the Gods,Thunderbolt,10000.0,NaN,NaN,NaN
8,Hera,Queen of the Gods,Peacock,8500.0,NaN,NaN,NaN
9,NaN,Queen of the Underworld,NaN,NaN,Persephone,Pomegranate,7800.0

In [9]:
average_df = joined_df.groupby('Domain')[['Age_x','Age_y']].mean()
average_df['Average'] = average_df.mean(axis=1)
average_df

                           Age_x   Age_y  Average
Domain
God of the Sea            9000.0     NaN   9000.0
God of the Underworld     9500.0     NaN   9500.0
Goddess of Agriculture       NaN  8000.0   8000.0
Goddess of Love              NaN  7000.0   7000.0
Goddess of Wisdom         8000.0     NaN   8000.0
Goddess of the Hearth        NaN  8200.0   8200.0
Goddess of the Hunt          NaN  7500.0   7500.0
King of the Gods         10000.0     NaN  10000.0
Queen of the Gods         8500.0     NaN   8500.0
Queen of the Underworld      NaN  7800.0   7800.0

Determine which god/goddess has the highest age, and then find out if they are a god or a goddess.

In [10]:
max_age = average_df['Average'].max()

if max_age in average_df['Age_x'].values:
    name = gods_df.loc[gods_df['Age'] == max_age, 'God']
    print(" God's maximum age = ", max_age, "\n", name)
    
elif max_age in average_df['Age_y'].values:
    name = goddesses_df.loc[goddesses_df['Age'] == max_age, 'Goddess']
    print(" Goddess has maximum age of ", max_age, "\n", name)

 God's maximum age =  10000.0
 0    Zeus
Name: God, dtype: object

5.Create a new column in each table called "Age_Group" and categorize the gods/goddesses into groups such as "Young" (age < 5000), "Middle-aged" (age between 5000 and 8000), and "Old" (age > 8000).

In [15]:
def get_age_group(age):
    if age < 5000:
        return "Young"
    elif age < 8000:
        return "Middle-aged"
    else:
        return "Old"


gods_df["Age_Group"] = gods_df["Age"].apply(get_age_group)

goddesses_df["Age_Group"] = goddesses_df["Age"].apply(get_age_group)

print(gods_df)
print()
print(goddesses_df)

        God                 Domain       Symbol    Age Age_Group
0      Zeus       King of the Gods  Thunderbolt  10000       Old
1  Poseidon         God of the Sea      Trident   9000       Old
2      Hera      Queen of the Gods      Peacock   8500       Old
3    Athena      Goddess of Wisdom          Owl   8000       Old
4     Hades  God of the Underworld       Helmet   9500       Old

      Goddess                   Domain         Symbol   Age    Age_Group
0   Aphrodite          Goddess of Love           Dove  7000  Middle-aged
1     Artemis      Goddess of the Hunt  Bow and Arrow  7500  Middle-aged
2     Demeter   Goddess of Agriculture          Wheat  8000          Old
3      Hestia    Goddess of the Hearth           Fire  8200          Old
4  Persephone  Queen of the Underworld    Pomegranate  7800  Middle-aged

6.Compare the average ages of gods and goddesses. Is there a significant age difference between them? If yes, which group tends to be older?

In [16]:
avg_age_gods = gods_df["Age"].mean()
avg_age_goddesses = goddesses_df["Age"].mean()

age_difference = abs(avg_age_gods - avg_age_goddesses)

if avg_age_gods > avg_age_goddesses:
    print("Gods are older on average.")
elif avg_age_gods < avg_age_goddesses:
    print("Goddesses are older on average.")
else:
    print("No significant age difference between gods and goddesses.")

Gods are older on average.

7.Write a Python program using for loop to iterate over the "Age" column of the merged table (after merging the gods and goddesses tables) and print out the names of gods/goddesses who are older than 8000 years.

In [12]:
for index, row in merged_df.iterrows():
    if row["Age"] > 8000:
        print(row["name"])

Zeus
Poseidon
Hera
Hades
Hestia

 8.Write a Python program to find the oldest god/goddess from the merged table (after merging the gods and goddesses tables) 
  by iterating through the "Age" column using a while loop. Print out the name of the oldest god/goddess and their age.

In [13]:
oldest_age = 0
oldest_name = None

index = 0
while index < len(merged_df):
    row = merged_df.iloc[index]  
    if row["Age"] > oldest_age:
        oldest_age = row["Age"]
        oldest_name = row["name"]
    index += 1

print("Oldest:", oldest_name, "with age", oldest_age)

Oldest: Zeus with age 10000